7767517
138 153
Input                    in0                      0 1 in0
MemoryData               /Constant_output_0       0 1 1 0=1 1=1 2=3
MemoryData               /Constant_1_output_0     0 1 2 0=1 1=1 2=3
BinaryOp                 sub_0                    2 1 in0 1 3 0=1
BinaryOp                 div_1                    2 1 3 2 4 0=3
Convolution              conv_52                  1 1 4 5 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_19                1 1 5 6 0=0.166667 1=0.5
ConvolutionDepthWise     convdwrelu_0             1 1 6 7 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_0              1 2 7 8 9
Pooling                  gap_0                    1 1 9 10 0=1 4=1
Convolution              convrelu_0               1 1 10 11 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 9=1
Convolution              conv_54                  1 1 11 12 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
HardSigmoid              hsigmoid_10              1 1 12 13 0=0.166667 1=0.5
Reshape                  reshape_95               1 1 13 14 0=1 1=1 2=-1
BinaryOp                 mul_2                    2 1 14 8 15 0=2
Convolution              conv_55                  1 1 15 16 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              convrelu_1               1 1 16 17 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 17 18 0=72 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 7=72 9=1
Convolution              conv_57                  1 1 18 19 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Split                    splitncnn_1              1 2 19 20 21
Convolution              convrelu_2               1 1 21 22 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 22 23 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88 9=1
Convolution              conv_59                  1 1 23 24 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112
BinaryOp                 add_3                    2 1 24 20 25 0=0
Convolution              conv_60                  1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_20                1 1 26 27 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_109               1 1 27 28 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_21                1 1 28 29 0=0.166667 1=0.5
Split                    splitncnn_2              1 2 29 30 31
Pooling                  gap_1                    1 1 31 32 0=1 4=1
Convolution              convrelu_3               1 1 32 33 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_62                  1 1 33 34 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSigmoid              hsigmoid_11              1 1 34 35 0=0.166667 1=0.5
Reshape                  reshape_96               1 1 35 36 0=1 1=1 2=-1
BinaryOp                 mul_4                    2 1 36 30 37 0=2
Convolution              conv_63                  1 1 37 38 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
Split                    splitncnn_3              1 2 38 39 40
Convolution              conv_64                  1 1 40 41 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_22                1 1 41 42 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_110               1 1 42 43 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
HardSwish                hswish_23                1 1 43 44 0=0.166667 1=0.5
Split                    splitncnn_4              1 2 44 45 46
Pooling                  gap_2                    1 1 46 47 0=1 4=1
Convolution              convrelu_4               1 1 47 48 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360 9=1
Convolution              conv_66                  1 1 48 49 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
HardSigmoid              hsigmoid_12              1 1 49 50 0=0.166667 1=0.5
Reshape                  reshape_97               1 1 50 51 0=1 1=1 2=-1
BinaryOp                 mul_5                    2 1 51 45 52 0=2
Convolution              conv_67                  1 1 52 53 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_6                    2 1 53 39 54 0=0
Split                    splitncnn_5              1 2 54 55 56
Convolution              conv_68                  1 1 56 57 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_24                1 1 57 58 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_111               1 1 58 59 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
HardSwish                hswish_25                1 1 59 60 0=0.166667 1=0.5
Split                    splitncnn_6              1 2 60 61 62
Pooling                  gap_3                    1 1 62 63 0=1 4=1
Convolution              convrelu_5               1 1 63 64 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360 9=1
Convolution              conv_70                  1 1 64 65 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
HardSigmoid              hsigmoid_13              1 1 65 66 0=0.166667 1=0.5
Reshape                  reshape_98               1 1 66 67 0=1 1=1 2=-1
BinaryOp                 mul_7                    2 1 67 61 68 0=2
Convolution              conv_71                  1 1 68 69 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_8                    2 1 69 55 70 0=0
Convolution              conv_72                  1 1 70 71 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
HardSwish                hswish_26                1 1 71 72 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_112               1 1 72 73 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120
HardSwish                hswish_27                1 1 73 74 0=0.166667 1=0.5
Split                    splitncnn_7              1 2 74 75 76
Pooling                  gap_4                    1 1 76 77 0=1 4=1
Convolution              convrelu_6               1 1 77 78 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_74                  1 1 78 79 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_14              1 1 79 80 0=0.166667 1=0.5
Reshape                  reshape_99               1 1 80 81 0=1 1=1 2=-1
BinaryOp                 mul_9                    2 1 81 75 82 0=2
Convolution              conv_75                  1 1 82 83 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
Split                    splitncnn_8              1 2 83 84 85
Convolution              conv_76                  1 1 85 86 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
HardSwish                hswish_28                1 1 86 87 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_113               1 1 87 88 0=144 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3600 7=144
HardSwish                hswish_29                1 1 88 89 0=0.166667 1=0.5
Split                    splitncnn_9              1 2 89 90 91
Pooling                  gap_5                    1 1 91 92 0=1 4=1
Convolution              convrelu_7               1 1 92 93 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760 9=1
Convolution              conv_78                  1 1 93 94 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
HardSigmoid              hsigmoid_15              1 1 94 95 0=0.166667 1=0.5
Reshape                  reshape_100              1 1 95 96 0=1 1=1 2=-1
BinaryOp                 mul_10                   2 1 96 90 97 0=2
Convolution              conv_79                  1 1 97 98 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
BinaryOp                 add_11                   2 1 98 84 99 0=0
Convolution              conv_80                  1 1 99 100 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
HardSwish                hswish_30                1 1 100 101 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_114               1 1 101 102 0=288 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=7200 7=288
HardSwish                hswish_31                1 1 102 103 0=0.166667 1=0.5
Split                    splitncnn_10             1 2 103 104 105
Pooling                  gap_6                    1 1 105 106 0=1 4=1
Convolution              convrelu_8               1 1 106 107 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20736 9=1
Convolution              conv_82                  1 1 107 108 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20736
HardSigmoid              hsigmoid_16              1 1 108 109 0=0.166667 1=0.5
Reshape                  reshape_101              1 1 109 110 0=1 1=1 2=-1
BinaryOp                 mul_12                   2 1 110 104 111 0=2
Convolution              conv_83                  1 1 111 112 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Split                    splitncnn_11             1 2 112 113 114
Convolution              conv_84                  1 1 114 115 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_32                1 1 115 116 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_115               1 1 116 117 0=576 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=14400 7=576
HardSwish                hswish_33                1 1 117 118 0=0.166667 1=0.5
Split                    splitncnn_12             1 2 118 119 120
Pooling                  gap_7                    1 1 120 121 0=1 4=1
Convolution              convrelu_9               1 1 121 122 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution              conv_86                  1 1 122 123 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944
HardSigmoid              hsigmoid_17              1 1 123 124 0=0.166667 1=0.5
Reshape                  reshape_102              1 1 124 125 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 125 119 126 0=2
Convolution              conv_87                  1 1 126 127 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_14                   2 1 127 113 128 0=0
Split                    splitncnn_13             1 2 128 129 130
Convolution              conv_88                  1 1 130 131 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_34                1 1 131 132 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_116               1 1 132 133 0=576 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=14400 7=576
HardSwish                hswish_35                1 1 133 134 0=0.166667 1=0.5
Split                    splitncnn_14             1 2 134 135 136
Pooling                  gap_8                    1 1 136 137 0=1 4=1
Convolution              convrelu_10              1 1 137 138 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution              conv_90                  1 1 138 139 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944
HardSigmoid              hsigmoid_18              1 1 139 140 0=0.166667 1=0.5
Reshape                  reshape_103              1 1 140 141 0=1 1=1 2=-1
BinaryOp                 mul_15                   2 1 141 135 142 0=2
Convolution              conv_91                  1 1 142 143 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_16                   2 1 143 129 144 0=0
Convolution              conv_92                  1 1 144 145 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_36                1 1 145 146 0=0.166667 1=0.5
Pooling                  gap_9                    1 1 146 147 0=1 4=1
Reshape                  reshape_104              1 1 147 148 0=1 1=1 2=-1
Flatten                  flatten_105              1 1 148 149
InnerProduct             linear_93                1 1 149 150 0=1024 1=1 2=589824
HardSwish                hswish_37                1 1 150 151 0=0.166667 1=0.5
InnerProduct             linear_94                1 1 151 out0 0=1000 1=1 2=1024000
