/* automatically generated by rust-bindgen 0.60.1 */

#![no_std]
#![allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]

pub const __llvm__: u32 = 1;
pub const __clang__: u32 = 1;
pub const __clang_major__: u32 = 6;
pub const __clang_minor__: u32 = 0;
pub const __clang_patchlevel__: u32 = 0;
pub const __clang_version__: &[u8; 31usize] = b"6.0.0 (tags/RELEASE_600/final)\0";
pub const __GNUC_MINOR__: u32 = 2;
pub const __GNUC_PATCHLEVEL__: u32 = 1;
pub const __GNUC__: u32 = 4;
pub const __GXX_ABI_VERSION: u32 = 1002;
pub const __ATOMIC_RELAXED: u32 = 0;
pub const __ATOMIC_CONSUME: u32 = 1;
pub const __ATOMIC_ACQUIRE: u32 = 2;
pub const __ATOMIC_RELEASE: u32 = 3;
pub const __ATOMIC_ACQ_REL: u32 = 4;
pub const __ATOMIC_SEQ_CST: u32 = 5;
pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM: u32 = 0;
pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP: u32 = 1;
pub const __OPENCL_MEMORY_SCOPE_DEVICE: u32 = 2;
pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES: u32 = 3;
pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP: u32 = 4;
pub const __PRAGMA_REDEFINE_EXTNAME: u32 = 1;
pub const __VERSION__: &[u8; 54usize] = b"4.2.1 Compatible Clang 6.0.0 (tags/RELEASE_600/final)\0";
pub const __OBJC_BOOL_IS_BOOL: u32 = 0;
pub const __CONSTANT_CFSTRINGS__: u32 = 1;
pub const __ORDER_LITTLE_ENDIAN__: u32 = 1234;
pub const __ORDER_BIG_ENDIAN__: u32 = 4321;
pub const __ORDER_PDP_ENDIAN__: u32 = 3412;
pub const __BYTE_ORDER__: u32 = 1234;
pub const __LITTLE_ENDIAN__: u32 = 1;
pub const _LP64: u32 = 1;

    pub fn ferror(stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush(fp: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn setvbuf(
        stream: *mut FILE,
        buf: *mut ::core::ffi::c_char,
        mode: ::core::ffi::c_int,
        size: size_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn setbuffer(stream: *mut FILE, buf: *mut ::core::ffi::c_char, size: size_t);
}
extern "C" {
    pub fn setbuf(stream: *mut FILE, buf: *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn asprintf(
        strp: *mut *mut ::core::ffi::c_char,
        fmt: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vasprintf(
        strp: *mut *mut ::core::ffi::c_char,
        fmt: *const ::core::ffi::c_char,
        ap: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn popen(
        command: *const ::core::ffi::c_char,
        type_: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(stream: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(s: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
pub type wchar_t = ::core::ffi::c_int;
pub type wint_t = ::core::ffi::c_uint;
pub type wctype_t = ::core::ffi::c_int;
extern "C" {
    pub fn waitpid(
        pid: pid_t,
        status: *mut ::core::ffi::c_int,
        options: ::core::ffi::c_int,
    ) -> pid_t;
}
extern "C" {
    pub fn wait(status: *mut ::core::ffi::c_int) -> pid_t;
}
extern "C" {
    pub static mut _ctype_: [::core::ffi::c_uchar; 0usize];
}
pub type int_least8_t = ::core::ffi::c_schar;
pub type int_least16_t = ::core::ffi::c_short;
pub type int_least32_t = ::core::ffi::c_int;
pub type int_least64_t = ::core::ffi::c_long;
pub type uint_least8_t = ::core::ffi::c_uchar;
pub type uint_least16_t = ::core::ffi::c_ushort;
pub type uint_least32_t = ::core::ffi::c_uint;
pub type uint_least64_t = ::core::ffi::c_ulong;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_short;
pub type int_fast32_t = ::core::ffi::c_int;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ushort;
pub type uint_fast32_t = ::core::ffi::c_uint;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = ::core::ffi::c_long;
pub type uintmax_t = ::core::ffi::c_ulong;
extern "C" {
    pub fn isspace(c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ::core::ffi::c_ushort;
}
extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *mut i32;
}
extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *mut i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv {
    pub quot: ::core::ffi::c_long,
    pub rem: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_ldiv() {
    assert_eq!(
        ::core::mem::size_of::<ldiv>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<ldiv>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<ldiv>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!("Offset of field: ", stringify!(ldiv), "::", stringify!(rem))
        );
    }
    test_field_rem();
}
pub type ldiv_t = ldiv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv {
    pub quot: ::core::ffi::c_longlong,
    pub rem: ::core::ffi::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv() {
    assert_eq!(
        ::core::mem::size_of::<lldiv>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<lldiv>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<lldiv>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
pub type lldiv_t = lldiv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div {
    pub quot: ::core::ffi::c_int,
    pub rem: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_div() {
    assert_eq!(
        ::core::mem::size_of::<div>(),
        8usize,
        concat!("Size of: ", stringify!(div))
    );
    assert_eq!(
        ::core::mem::align_of::<div>(),
        4usize,
        concat!("Alignment of ", stringify!(div))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<div>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!("Offset of field: ", stringify!(div), "::", stringify!(quot))
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<div>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            4usize,
            concat!("Offset of field: ", stringify!(div), "::", stringify!(rem))
        );
    }
    test_field_rem();
}
pub type div_t = div;
extern "C" {
    #[doc = " Converts the initial part of the string in @a nptr to a long integer value"]
    #[doc = " according to the given @a base, which must be between 2 and 36 inclusive,"]
    #[doc = " or be the special value 0."]
    #[doc = ""]
    #[doc = " The remainder of the string is converted to a @code long int @endcode value"]
    #[doc = " in the obvious manner, stopping at the first character which is not a valid"]
    #[doc = " digit in the given @a base."]
    #[doc = ""]
    #[doc = " @param nptr"]
    #[doc = "   The string to parse. It may begin with an arbitrary amount of white space"]
    #[doc = "   (determined by #isspace()) followed by a single optional '+' or '-' sign."]
    #[doc = "   The string is interpreted until the first invalid character is"]
    #[doc = "   encountered."]
    #[doc = " @param endptr"]
    #[doc = "   If @a endptr is not @c NULL, the address of the first invalid character is"]
    #[doc = "   stored in @c *endptr."]
    #[doc = " @param base"]
    #[doc = "   The base of interpreted number."]
    #[doc = "   If @a base is zero or 16, the string may include a @c 0x prefix, and the"]
    #[doc = "   number will be read in base 16 (hex)."]
    #[doc = "   Otherwise, a zero base is taken as 10 (decimal) unless the next character"]
    #[doc = "   is @c '0', in which case it is taken as 8 (octal)."]
    #[doc = " @return"]
    #[doc = "   The parsed number bounded to @code [LONG_MIN..LONG_MAX] @endcode or zero"]
    #[doc = "   if there were no valid characters representing a number in the given"]
    #[doc = "   @a base."]
    pub fn strtol(
        nptr: *const ::core::ffi::c_char,
        endptr: *mut *mut ::core::ffi::c_char,
        base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn strtoul(
        nptr: *const ::core::ffi::c_char,
        endptr: *mut *mut ::core::ffi::c_char,
        base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulong;
}
extern "C" {
    pub fn strtoll(
        nptr: *const ::core::ffi::c_char,
        endptr: *mut *mut ::core::ffi::c_char,
        base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_longlong;
}
extern "C" {
    pub fn strtoull(
        nptr: *const ::core::ffi::c_char,
        endptr: *mut *mut ::core::ffi::c_char,
        base: ::core::ffi::c_int,
    ) -> ::core::ffi::c_ulonglong;
}
extern "C" {
    pub fn strtof(nptr: *const ::core::ffi::c_char, endptr: *mut *mut ::core::ffi::c_char) -> f32;
}
extern "C" {
    pub fn strtod(nptr: *const ::core::ffi::c_char, endptr: *mut *mut ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn strtold(nptr: *const ::core::ffi::c_char, endptr: *mut *mut ::core::ffi::c_char)
        -> u128;
}
extern "C" {
    pub fn atof(nptr: *const ::core::ffi::c_char) -> f64;
}
extern "C" {
    pub fn atoi(nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn atol(nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn atoq(nptr: *const ::core::ffi::c_char) -> ::core::ffi::c_longlong;
}
extern "C" {
    #[doc = " Convert integer to string."]
    #[doc = " Converts an integer value to a null-terminated string using the specified base and stores the result in the array given by buf parameter."]
    #[doc = " If num < 0, the resulting string is preceded with '-' (regardless of base). No prefix is used to explicitly specify the base."]
    #[doc = " @param num Number to convert."]
    #[doc = " @param buf Character array to store the result. This should be long enough to contain any possible value."]
    #[doc = " @param base Base for the conversion. 1 < base < 37."]
    #[doc = " @return Pointer to buf."]
    pub fn itoa(
        num: ::core::ffi::c_int,
        buf: *mut ::core::ffi::c_char,
        base: ::core::ffi::c_ushort,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn calloc(
        nmemb: ::core::ffi::c_ulong,
        size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn malloc(size: ::core::ffi::c_ulong) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn free(ptr: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn realloc(
        ptr: *mut ::core::ffi::c_void,
        size: ::core::ffi::c_ulong,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memalign(boundary: size_t, size: size_t) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn posix_memalign(
        memptr: *mut *mut ::core::ffi::c_void,
        alignment: size_t,
        size: size_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn qsort(
        base: *mut ::core::ffi::c_void,
        nmemb: size_t,
        size: size_t,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    );
}
extern "C" {
    pub fn bsearch(
        key: *const ::core::ffi::c_void,
        base: *const ::core::ffi::c_void,
        nmemb: size_t,
        size: size_t,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Find the smallest element, greater or equals to specified."]
    pub fn lower_bound(
        key: *const ::core::ffi::c_void,
        base: *const ::core::ffi::c_void,
        nmemb: size_t,
        size: size_t,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Find the smallest element, strictly greater than specified."]
    pub fn upper_bound(
        key: *const ::core::ffi::c_void,
        base: *const ::core::ffi::c_void,
        nmemb: size_t,
        size: size_t,
        compar: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn rand() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn rand_r(seedp: *mut ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn srand(seed: ::core::ffi::c_uint);
}
extern "C" {
    pub fn random() -> ::core::ffi::c_long;
}
extern "C" {
    pub fn srandom(seed: ::core::ffi::c_uint);
}
extern "C" {
    pub fn initstate(
        seed: ::core::ffi::c_uint,
        state: *mut ::core::ffi::c_char,
        n: size_t,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn setstate(state: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::core::ffi::c_int,
    pub rand_deg: ::core::ffi::c_int,
    pub rand_sep: ::core::ffi::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    fn test_field_fptr() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(fptr)
            )
        );
    }
    test_field_fptr();
    fn test_field_rptr() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rptr)
            )
        );
    }
    test_field_rptr();
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
    fn test_field_rand_type() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_type)
            )
        );
    }
    test_field_rand_type();
    fn test_field_rand_deg() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_deg)
            )
        );
    }
    test_field_rand_deg();
    fn test_field_rand_sep() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_sep)
            )
        );
    }
    test_field_rand_sep();
    fn test_field_end_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(end_ptr)
            )
        );
    }
    test_field_end_ptr();
}
extern "C" {
    pub fn random_r(buf: *mut random_data, result: *mut i32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn srandom_r(seed: ::core::ffi::c_uint, buf: *mut random_data) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn initstate_r(
        seed: ::core::ffi::c_uint,
        statebuf: *mut ::core::ffi::c_char,
        statelen: size_t,
        buf: *mut random_data,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn setstate_r(
        statebuf: *mut ::core::ffi::c_char,
        buf: *mut random_data,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn lldiv(num: ::core::ffi::c_longlong, denom: ::core::ffi::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ldiv(num: ::core::ffi::c_long, denom: ::core::ffi::c_long) -> ldiv_t;
}
extern "C" {
    pub fn div(num: ::core::ffi::c_int, denom: ::core::ffi::c_int) -> div_t;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn exit(status: ::core::ffi::c_int);
}
extern "C" {
    pub fn _Exit(status: ::core::ffi::c_int);
}
extern "C" {
    pub fn getenv(name: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn putenv(string: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn setenv(
        envname: *const ::core::ffi::c_char,
        envval: *const ::core::ffi::c_char,
        overwrite: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn unsetenv(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn clearenv() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn system(command: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mkstemp(path_template: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn realpath(
        file_name: *const ::core::ffi::c_char,
        resolved_name: *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn mbtowc(
        out: *mut wchar_t,
        in_: *const ::core::ffi::c_char,
        n: size_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn wctomb(out: *mut ::core::ffi::c_char, in_: *const wchar_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mblen(str_: *const ::core::ffi::c_char, max: size_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn atexit(func: ::core::option::Option<unsafe extern "C" fn()>) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn mbstowcs(
        wcstring: *mut wchar_t,
        mbstring: *const ::core::ffi::c_char,
        n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(mbstr: *mut ::core::ffi::c_char, wcstr: *const wchar_t, max: size_t) -> size_t;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::core::ffi::c_uint,
    pub fp_offset: ::core::ffi::c_uint,
    pub overflow_arg_area: *mut ::core::ffi::c_void,
    pub reg_save_area: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::core::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::core::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    fn test_field_gp_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).gp_offset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(gp_offset)
            )
        );
    }
    test_field_gp_offset();
    fn test_field_fp_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).fp_offset) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(fp_offset)
            )
        );
    }
    test_field_fp_offset();
    fn test_field_overflow_arg_area() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).overflow_arg_area) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(overflow_arg_area)
            )
        );
    }
    test_field_overflow_arg_area();
    fn test_field_reg_save_area() {
        assert_eq!(
            unsafe {
                let uninit = ::core::mem::MaybeUninit::<__va_list_tag>::uninit();
                let ptr = uninit.as_ptr();
                ::core::ptr::addr_of!((*ptr).reg_save_area) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(reg_save_area)
            )
        );
    }
    test_field_reg_save_area();
}
